# Найкращий студент за трьома критеріями
students = {
    "Anna": [90, 85, 90, 70],
    "John": [95, 80, 85, 90],
    "Mike": [90, 90, 90, 80],
    "Kate": [85, 85, 95, 90],
    "Lisa": [90, 80, 90, 85]
}
#Вибери найкращого студента за такими критеріями, у вказаному порядку:
#Найвищий середній бал.
#Якщо середні бали однакові — найбільша кількість оцінок 90 або вище.
#Якщо знову нічия — найбільша кількість різних оцінок.
#Якщо все ще нічия — ім’я за алфавітом.
#Виведи ім’я переможця та його середній бал.

srt = sorted(students.keys(), key = lambda item:(
    -sum(students[item])/len(students[item]),
    -sum(1 for grade in students[item] if grade >= 90),
    len(set(students[item])),
    item

))
#Виведи ім’я переможця та його середній бал.
best = srt[0]
best_avg = sum(students[best])/len(students[best]) 
print(best, ":", best_avg)